{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0015d\u0002\u0000\u0018S(\u0003\u0000\u0000\u0000Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?(\u0000\u0000\u0000\u0000(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000x(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u001e\u0000\u0000\u0000<ipython-input-7-dcdefdfb1833>t\b\u0000\u0000\u0000<lambda>\u0004\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "trainable": true, "function_type": "lambda", "arguments": {}, "input_dtype": "float32", "batch_input_shape": [null, 3, 75, 320], "output_shape": [3, 75, 320], "output_shape_type": "raw"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 24, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "elu", "nb_row": 5}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_1", "epsilon": 1e-05, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 36, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "elu", "nb_row": 5}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_2", "epsilon": 1e-05, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 48, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "elu", "nb_row": 5}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_3", "epsilon": 1e-05, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_4", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "elu", "nb_row": 3}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_4", "epsilon": 1e-05, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_5", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "elu", "nb_row": 3}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_5", "epsilon": 1e-05, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "elu", "output_dim": 100}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "elu", "output_dim": 50}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "elu", "output_dim": 10}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_4", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}}]}